ohararp/IDF-FlipDotCircleClock/sdkconfig.defaults
# Target: ESP32-S3 (Unexpected Maker FeatherS3)
CONFIG_IDF_TARGET="esp32s3"

# Flash: 16MB
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# CPU: 240MHz dual-core
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

# Console over USB CDC (FeatherS3 native USB)
CONFIG_ESP_CONSOLE_USB_CDC=y

# PSRAM: 8MB Quad SPI on FeatherS3 (confirmed from schematic — 4 data lines, NOT octal)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_USE_MALLOC=y

# Bluetooth: NimBLE for BLE provisioning
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# WiFi provisioning security (Security 1 with proof-of-possession)
CONFIG_ESP_PROTOCOMM_SUPPORT_SECURITY_VERSION_1=y

# Partition table: use larger app partition (16MB flash, plenty of room)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
